### Idiomatic Python
- Tranformation code into beautifull Python
- Replaces traditional index manipulation with python code looping idioms

In [36]:
# looping over a range of num
for i in [0,1,2,3,4,5]:
    print(i ** 2,end = ' ')
print()
for  i in range(6):
    print(i** 2,end = " ")

0 1 4 9 16 25
0 1 4 9 16 25

In [38]:
li = [1,2,3,4,5]
for i in range(len(li)):
    print(li[i],end=' ')
print()
for i in li:
    print(i,end=' ')

1 2 3 4 5
1 2 3 4 5

In [51]:
# looping from backwards
li = [1,2,3,4,5]
for i in range(len(li)-1,-1,-1):
    print(li[i],end=' ')
print()
for i in reversed(li):
    print(i,end=' ')

5 4 3 2 1
5 4 3 2 1

In [54]:
li = [1,2,3,4,5]
for i,a in enumerate(li):
    print(i,"-->",a)

0 --> 1
1 --> 2
2 --> 3
3 --> 4
4 --> 5

In [57]:
li = [1,2,3,4,5]
a = [1,2,3,4,5,6,7,8]
n = min(len(li),len(a))
for i in range(n):
    print(li[i],' ',a)
print()
for i in zip(li,a):
    print(i,' ',a)

1   [1, 2, 3, 4, 5, 6, 7, 8]
2   [1, 2, 3, 4, 5, 6, 7, 8]
3   [1, 2, 3, 4, 5, 6, 7, 8]
4   [1, 2, 3, 4, 5, 6, 7, 8]
5   [1, 2, 3, 4, 5, 6, 7, 8]

(1, 1)   [1, 2, 3, 4, 5, 6, 7, 8]
(2, 2)   [1, 2, 3, 4, 5, 6, 7, 8]
(3, 3)   [1, 2, 3, 4, 5, 6, 7, 8]
(4, 4)   [1, 2, 3, 4, 5, 6, 7, 8]
(5, 5)   [1, 2, 3, 4, 5, 6, 7, 8]

In [64]:
# looping in sorted order
li = [4,2,3,1,5]
for i in sorted(li):
    print(i,end =' ')
print()
for i in sorted(li,reverse=True):
    print(i,end=' ')

1 2 3 4 5
5 4 3 2 1

In [78]:
# dictionaries
d = {'Name':'Gitam','Emailid':'gitam@gmail.edu','Address':'Vizag'}
for k in d:
    print(k,end = ' ')
print()

Name Emailid Address

In [79]:
for k in d.values():
    print(k,end = ' ')

Gitam gitam@gmail.edu Vizag

In [95]:
for k in d.keys():
    if k.startswith('A'):
        del d[k]

In [96]:
print(d)

{'Name': 'Gitam', 'Emailid': 'gitam@gmail.edu'}

## List comprehensions

In [104]:
li = []
for i in range(10):
    a = i ** 2
    li.append(a)
print(sum(li))
print()

print(sum(i**2 for i in range(10)))

285

285

In [106]:
com_list = [i ** 2 for i in range (10)]
com_list

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [107]:
for i in li:
    if i % 2 == 0:
        print (i,end = ' ')

0 4 16 36 64

# Lambda Function
- Anonymous functions means that a function is without a name
- any lambda function will be defined with lambda
- syntax : lambda arg:expression

In [114]:
def square(n):
    return n*n
square(10)

100

In [116]:
a = lambda x : x * x
print(a(10))

100

## Use of lambda with filter

In [119]:
def filterList(li):
    a= []
    for i in li:
        if i % 2 == 0:
            a.append(i)
    return a
li = [1,2,3,4,5,6,7,8]
filterList(li)

[2, 4, 6, 8]

In [141]:
li = [1,2,3,4,5,6,7,8]
lam_li = list(filter(lambda x : (x%2==0),li))
print(lam_li)

[2, 4, 6, 8]

## Lambda with map()
- map() function in python takes in a function and lists as argument

In [142]:
def squareList(li):
    a = []
    for i in li:
        a.append(i*2)
    return a
li = [1,2,3,4,5,6,7,8]
squareList(li)

[2, 4, 6, 8, 10, 12, 14, 16]

In [145]:
li = [1,2,3,4,5,6,7,8]
map_list = list(map(lambda x : x * 2 , li))
print (map_list)

[2, 4, 6, 8, 10, 12, 14, 16]

## lambda with reduce()

In [148]:
def sumList(li):
    s = 0
    for i in li:
        s += i
    return s
li = [1,2,3,4,5,6,7,8]
sumList(li)

36

In [150]:
from functools import reduce
li = [1,2,3,4,5,6,7,8]
s = reduce((lambda x,y:x+y),li)
print(s)

36

## standard packages
### pandas , numpy, Matplotib

### Pandas
- Data cleaning
- Data transformation
- Data Analysis

### Notations
- series
    - A series is a 1d object
- DataFrames
    - a dataframe is a 2d object

In [167]:
import pandas as pd
li1 = {'s1':31,'s2':32,'s3':33}
li2 = {'s1':35,'s2':35,'s3':36}
li1 = pd.Series(li1)
li2 = pd.Series(li2)
print(li1)
print(li2)

s1    31
s2    32
s3    33
dtype: int64
s1    35
s2    35
s3    36
dtype: int64

In [168]:
final = {'Internal1':li1,'Internal2':li2}
final = pd.DataFrame(final)
print(final)

    Internal1  Internal2
s1         31         35
s2         32         35
s3         33         36

In [169]:
final.columns # returns the name of the columns

Index(['Internal1', 'Internal2'], dtype='object')

In [170]:
final.values # returns all values in a 2 dimentional array

array([[31, 35],
       [32, 35],
       [33, 36]], dtype=int64)

In [179]:
 final.values[2] # 2 represents the row index

array([ 0, 36], dtype=int64)

In [180]:
final.values[2][0] = 0
print (final)

    Internal1  Internal2
s1         31         35
s2         32         35
s3          0         36

In [181]:
for row in final.values:
    print('Internal 1 Marks -',row[0],'Internal 2 Marks -',row[1])

Internal 1 Marks - 31 Internal 2 Marks - 35
Internal 1 Marks - 32 Internal 2 Marks - 35
Internal 1 Marks - 0 Internal 2 Marks - 36

In [184]:
final.loc['s4'] = [20,18] # insert the new record into data frame
final

    Internal1  Internal2
s1         31         35
s2         32         35
s3          0         36
s4         20         18

In [197]:
pwd

'C:\\Users\\Vishwanath\\Desktop\\Problem Solving & Programming'

In [215]:
filepath = 'DataFiles/Income.csv'
def readCsvData(filepath):
    return pd.read_csv(filepath)
readCsvData(filepath)

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,62993,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [217]:
df = readCsvData(filepath)

In [220]:
# Extract income of all states in year 2013
# Alabama : 41381
# ...............
for row in df.values:
    print(row[1],' : ',row[-1])

Alabama  :  41381
Alaska  :  61137
Arizona  :  50602
Arkansas  :  39919
California  :  57528

In [1504]:
# Average income california
s = 0
for i in range(2,11):
    s += df.values[4][i]
print( s // (len(df.values[4][2:])))

55350

In [1505]:
# Functions which only displays the column names in the list
# GEOID State 2005 2006 2007 2008 2009 2010 2011 2012 2013
def printDataFrameColumns(df):
    li = []
    for i in df.columns:
        li.append(i)
    return li
printDataFrameColumns(df)

['GEOID',
 'State',
 '2005',
 '2006',
 '2007',
 '2008',
 '2009',
 '2010',
 '2011',
 '2012',
 '2013']

In [1518]:
filepath = 'DataFiles/RegularSeasonCompactResults.csv'
def readCsvData(filepath):
    return pd.read_csv(filepath)
df = readCsvData(filepath)

In [1522]:
print(len(df.columns))
print(len(df.values))

8
145289

In [1532]:
df.shape

(145289, 8)

In [1534]:
# To know only first few rows -- head()
df.head()

   Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0    1985      20   1228      81   1328      64    N      0
1    1985      25   1106      77   1354      70    H      0
2    1985      25   1112      63   1223      56    H      0
3    1985      25   1165      70   1432      54    H      0
4    1985      25   1192      86   1447      74    H      0

In [1537]:
# To know only last few rows -- tail()
df.tail()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0
145286    2016     132   1246      82   1401      77    N      1
145287    2016     132   1277      66   1345      62    N      0
145288    2016     132   1386      87   1433      74    N      0

In [1538]:
# Convert all column names into list
df.columns.tolist()

['Season', 'Daynum', 'Wteam', 'Wscore', 'Lteam', 'Lscore', 'Wloc', 'Numot']

In [1540]:
# describe() min,max,couint,mean and etc
df.describe()

,Season,Daynum,Wteam,Wscore,Lteam,Lscore,Numot
count,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000,145289.000000
mean,2001.574834,75.223816,1286.720646,76.600321,1282.864064,64.497009,0.044387
std,9.233342,33.287418,104.570275,12.173033,104.829234,11.380625,0.247819
min,1985.000000,0.000000,1101.000000,34.000000,1101.000000,20.000000,0.000000
25%,1994.000000,47.000000,1198.000000,68.000000,1191.000000,57.000000,0.000000
50%,2002.000000,78.000000,1284.000000,76.000000,1280.000000,64.000000,0.000000
75%,2010.000000,103.000000,1379.000000,84.000000,1375.000000,72.000000,0.000000
max,2016.000000,132.000000,1464.000000,186.000000,1464.000000,150.000000,6.000000

In [1541]:
df.max()

Season    2016
Daynum     132
Wteam     1464
Wscore     186
Lteam     1464
Lscore     150
Wloc         N
Numot        6
dtype: object

In [1543]:
df.min()

Season    1985
Daynum       0
Wteam     1101
Wscore      34
Lteam     1101
Lscore      20
Wloc         A
Numot        0
dtype: object

In [1547]:
df['Season'].mean()

2001.5748336074996

In [1549]:
df['Season'].max()

2016

In [1550]:
df['Season'].sum()

290806806

In [1557]:
df.iloc[:-3]

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
0         1985      20   1228      81   1328      64    N      0
1         1985      25   1106      77   1354      70    H      0
2         1985      25   1112      63   1223      56    H      0
3         1985      25   1165      70   1432      54    H      0
4         1985      25   1192      86   1447      74    H      0
5         1985      25   1218      79   1337      78    H      0
6         1985      25   1228      64   1226      44    N      0
7         1985      25   1242      58   1268      56    N      0
8         1985      25   1260      98   1133      80    H      0
9         1985      25   1305      97   1424      89    H      0
10        1985      25   1307     103   1288      71    H      0
11        1985      25   1344      75   1438      71    N      0
12        1985      25   1374      91   1411      72    H      0
13        1985      25   1412      70   1397      65    N      0
14        1985      25   1417      87   1225      58    H      0
15        1985      26   1116      65   1368      62    H      0
16        1985      26   1120      92   1391      50    H      0
17        1985      26   1135      65   1306      60    A      0
18        1985      26   1143      58   1388      53    H      0
19        1985      26   1153      50   1184      48    H      0
20        1985      26   1165      47   1159      40    A      0
21        1985      26   1171      55   1216      52    H      0
22        1985      26   1173      76   1134      56    H      0
23        1985      26   1177      59   1296      58    H      0
24        1985      26   1193      79   1265      76    A      0
25        1985      26   1196     106   1416      55    H      0
26        1985      26   1206      95   1137      77    H      0
27        1985      26   1210      79   1149      66    H      0
28        1985      26   1211      64   1102      59    A      0
29        1985      26   1234      76   1114      47    H      0
...        ...     ...    ...     ...    ...     ...  ...    ...
145256    2016     130   1437      76   1344      68    N      0
145257    2016     130   1438      73   1274      68    N      0
145258    2016     130   1451      83   1315      78    N      1
145259    2016     130   1452      69   1328      67    N      0
145260    2016     131   1114      72   1418      65    N      0
145261    2016     131   1138      64   1103      61    N      0
145262    2016     131   1163      77   1396      62    N      0
145263    2016     131   1167      57   1308      54    N      0
145264    2016     131   1201      68   1361      63    N      0
145265    2016     131   1214      81   1354      69    N      0
145266    2016     131   1218      64   1253      60    N      0
145267    2016     131   1242      81   1452      71    N      0
145268    2016     131   1246      93   1208      80    N      0
145269    2016     131   1272      74   1408      54    N      0
145270    2016     131   1277      64   1268      61    N      0
145271    2016     131   1292      55   1330      53    N      0
145272    2016     131   1314      61   1438      57    N      0
145273    2016     131   1332      88   1428      57    N      0
145274    2016     131   1345      76   1276      59    N      0
145275    2016     131   1371      69   1437      67    N      0
145276    2016     131   1372      82   1394      60    N      0
145277    2016     131   1380      54   1238      53    N      0
145278    2016     131   1386      82   1173      79    N      0
145279    2016     131   1392      80   1436      74    H      0
145280    2016     131   1401      71   1261      38    N      0
145281    2016     131   1419      82   1426      71    N      0
145282    2016     131   1433      76   1172      54    N      0
145283    2016     131   1451      62   1285      59    N      0
145284    2016     132   1114      70   1419      50    N      0
145285    2016     132   1163      72   1272      58    N      0

[145286 rows x 8 columns]

In [1559]:
df.sort_values('Lscore').head()

        Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
100027    2008      66   1203      49   1387      20    H      0
49310     1997      66   1157      61   1204      21    H      0
89021     2006      44   1284      41   1343      21    A      0
85042     2005      66   1131      73   1216      22    H      0
103660    2009      26   1326      59   1359      22    H      0

In [1561]:
df.sort_values('Lscore').tail()

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
77873    2003     110   1383     142   1254     140    H      2
24970    1991      68   1258     186   1109     140    H      0
22074    1990      96   1261     148   1258     141    H      0
16853    1989      68   1258     162   1109     144    A      0
17867    1989      92   1258     181   1109     150    H      0

In [1570]:
# Filter the rows based on the condition 
df[df['Wscore'] > 170 ]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867    1989      92   1258     181   1109     150    H      0
19653    1990      30   1328     173   1109     101    H      0
24341    1991      47   1328     172   1258     112    H      0
24970    1991      68   1258     186   1109     140    H      0

In [1573]:
df[(df['Wscore'] > 170) & (df['Daynum'] > 50) ]

       Season  Daynum  Wteam  Wscore  Lteam  Lscore Wloc  Numot
17867    1989      92   1258     181   1109     150    H      0
24970    1991      68   1258     186   1109     140    H      0